# Assignment 1 - Data Wrangling 1

Name - Latpate Omkar
Roll No - 40

## Part 1 - Data Preprocessing

Data Wrangling is the process of converting data from the initial format to a format that may be better for analysis.

In [52]:
# importing required libraries
import pandas as pd
import numpy as np

Load the dataset using pandas library

In [13]:
df = pd.read_csv("Car Sales Missing Data.csv")

Check the contents of dataset using df.head() and df.tail() functions

In [14]:
df.head(5)

     Make Colour  Odometer (KM)  Doors      Price
0  Nissan  Black        10148.0    4.0  Rs1366850
1  Toyota  White        10217.0    4.0  Rs1144150
2  Toyota  White        10247.0    4.0  Rs1628300
3   Honda  White        10953.0    4.0   Rs831800
4  Nissan   Blue        10954.0    4.0  Rs1521950

In [15]:
df.tail(5)

       Make Colour  Odometer (KM)  Doors      Price
995  Toyota  White            NaN    4.0  Rs1706650
996  Toyota  White            NaN    4.0  Rs1767900
997     BMW  White            NaN    5.0  Rs1906400
998  Toyota  White            NaN    4.0        NaN
999  Toyota  White            NaN    4.0        NaN

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           951 non-null    object
 1   Colour         950 non-null    object
 2   Odometer (KM)  950 non-null    float64
 3   Doors          950 non-null    float64
 4   Price          950 non-null    object
dtypes: float64(2), object(3)
memory usage: 39.2+ KB

In [53]:
df.describe(include='all')

          Make Colour  Odometer (KM)        Doors         Price
count     1000   1000    1000.000000  1000.000000  1.000000e+03
unique       4      5            NaN          NaN           NaN
top     Toyota  White            NaN          NaN           NaN
freq       428    440            NaN          NaN           NaN
mean       NaN    NaN  131253.237895     4.011579  8.021407e+05
std        NaN    NaN   67343.562285     0.372843  4.182091e+05
min        NaN    NaN   10148.000000     3.000000  1.398000e+05
25%        NaN    NaN   72503.000000     4.000000  4.899250e+05
50%        NaN    NaN  131253.237895     4.000000  7.482500e+05
75%        NaN    NaN  190259.750000     4.000000  1.016100e+06
max        NaN    NaN  249860.000000     5.000000  2.622900e+06

### Evaluating for Missing Data

The missing values are converted to Python's default. We use Python's built-in functions to identify these missing values. There are two methods to detect missing data:

     1 - .isnull()
     2 - .notnull()
 
The output is a boolean value indicating whether the value that is passed into the argument is in fact missing data. "True" stands for missing value, while "False" stands for not missing value.

### Deal with missing data

#### 1.Drop data
    a. Drop the whole row
    b. Drop the whole column
#### 2.Replace data
    a. Replace it by mean
    b. Replace it by frequency / mode
    c. Replace it based on other functions

In [18]:
df.isnull()

      Make  Colour  Odometer (KM)  Doors  Price
0    False   False          False  False  False
1    False   False          False  False  False
2    False   False          False  False  False
3    False   False          False  False  False
4    False   False          False  False  False
..     ...     ...            ...    ...    ...
995  False   False           True  False  False
996  False   False           True  False  False
997  False   False           True  False  False
998  False   False           True  False   True
999  False   False           True  False   True

[1000 rows x 5 columns]

In [19]:
df.isnull().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [20]:
df.notnull()

     Make  Colour  Odometer (KM)  Doors  Price
0    True    True           True   True   True
1    True    True           True   True   True
2    True    True           True   True   True
3    True    True           True   True   True
4    True    True           True   True   True
..    ...     ...            ...    ...    ...
995  True    True          False   True   True
996  True    True          False   True   True
997  True    True          False   True   True
998  True    True          False   True  False
999  True    True          False   True  False

[1000 rows x 5 columns]

In [21]:
df.notnull().sum()

Make             951
Colour           950
Odometer (KM)    950
Doors            950
Price            950
dtype: int64

In [24]:
# calculate the mean vaule for "Odometer (KM)" column
avg_meter = df['Odometer (KM)'].mean()
avg_meter

131253.23789473684

In [25]:
# replace NaN by mean value in "Odometer (KM)" column
df['Odometer (KM)'].replace(np.nan, avg_meter, inplace=True)

In [29]:
# calculate the mean vaule for "Doors" column
avg_door = df['Doors'].mean()
avg_door

4.011578947368421

In [30]:
# replace NaN by mean value in "Doors" column
df['Doors'].replace(np.nan, avg_door, inplace=True)

In [33]:
# calculate the mode vaule for "Make" column
make_mode = df['Make'].mode()
make_mode

0    Toyota
Name: Make, dtype: object

In [36]:
# replace NaN by mode value in "Make" column
df['Make'].replace(np.nan, 'Toyota', inplace=True)

In [37]:
# calculate the mode vaule for "Colour" column
col_mode = df['Colour'].mode()
col_mode

0    White
Name: Colour, dtype: object

In [38]:
# replace NaN by mode value in "Colour" column
df['Colour'].replace(np.nan, 'White', inplace=True)

In [40]:
df.isnull().any()

Make             False
Colour           False
Odometer (KM)    False
Doors            False
Price             True
dtype: bool

In [41]:
df.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors            float64
Price             object
dtype: object

Converting column 'Price' Object datatype to float for calculation.

In [43]:
df['Price'] = df['Price'].replace('Rs', '', regex=True)

In [45]:
df['Price'] = df['Price'].astype('float')

In [47]:
mean = df['Price'].mean()
mean

802140.7368421053

In [48]:
df['Price'].fillna(mean, inplace=True)

In [50]:
df.isnull().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

## Part 2 - Data Formatting and Data Normalization

### Data Formatting

Data formatting is the process of transforming data into a common format, which helps users to perform comparisons.
This typically involves ensuring consistency in how data is represented, such as ensuring dates are in the same format (e.g., YYYY-MM-DD), ensuring numerical data is formatted consistently (e.g., using the same number of decimal places), and ensuring categorical variables are labeled consistently (e.g., using the same spelling and capitalization).

### Data Normalization

Data normalization is the process of transforming numerical data into a standard format to remove redundancy and improve the performance of machine learning algorithms. The goal of normalization is to bring all features to a similar scale without distorting differences in the ranges of values.

In [51]:
df.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors            float64
Price            float64
dtype: object

 At first data type of Price Column was Object which is not correct data type for Price.
So we have applied proper conversion rules to make its data type as float.

First I removed 'Rs' symbol from Price using :

    df['Price'] = df['Price'].replace('Rs', '', regex=True)
    
Then made its data type as float using astype() function :

    df['Price'] = df['Price'].astype('float')